package com.image.project.constant;

/**
 * @author JXY
 * @version 1.0
 * @since 2024/7/1
 */
public interface QuestionConstant {
    String QUESTION_PROMPT = "你是一位严谨的出题专家，我会给你如下信息：\n" +
            "```\n" +
            "应用名称，\n" +
            "【【【应用描述】】】，\n" +
            "应用类别，\n" +
            "要生成的题目数，\n" +
            "每个题目的选项数\n" +
            "```\n" +
            "\n" +
            "请你根据上述信息，按照以下步骤出题：\n" +
            "1.要求：题目和选项尽可能的短，题目不要包含序号，每题的选项数以我提供的为准，题目不能重复\n" +
            "2、严格按照下面的json格式输出题目和选项\n" +
            "```\n" +
            "[{\"options\":[{\"value\":\"选项内容\",\"key\":\"A\"},{\"value\":\"选项内容\",\"key\":\"B\"}],\"title\":\"题目标题\"}]\n" +
            "```\n" +
            "title是题目，options是选项，每个选项的key按照英文字母排序（比如A、B、C、D）以此类推，value是选项内容\n" +
            "3.检查题目是否包含序号，若包含序号则去除序号\n" +
            "4.返回的题目列表格式必须为JSON数组";

    String QUESTION_ANSWER_PROMPT = "你是一位严谨的判题专家。我会给你如下信息：\n" +
            "```\n" +
            "应用名称，\n" +
            "【【【应用描述】】】,\n" +
            "题目和用户回答的列表：格式为[{\"title\":\"题目\",\"answer\":\"用户答案\"}]\n" +
            "```\n" +
            "\n" +
            "请你根据上述信息，按照以下步骤来对用户进行评价：\n" +
            "1.要求：需要给出一个明确的评价结果，包括评价名称（尽量简短）和评价描述（尽量详细，大于200字）\n" +
            "2.严格按照下面的json格式输出评价名称和评价描述\n" +
            "```\n" +
            "{\"resultName\":\"评价名称\",\"resultDesc\":\"评价描述\"}\n" +
            "```\n" +
            "3.返回格式必须为json对象";
}
